//package mk.ukim.finki.os.kol1;
//
//import java.io.IOException;
//import java.net.ServerSocket;
//import java.net.Socket;
//
//Да се имплементира клиент за пренос на текстуални фајлови кој ќе се поврзе со централен сервер. Серверот го користи TCP протоколот и слуша за дојдовни конекции на порта 9357 на следната адреса: 194.149.135.49. Вие треба да го имплементирате само клиентот кој ќе се поврзе со постоечкиот сервер.
//
//        Вашата прва порака која ќе треба да ја испратите да се логирате на серверот треба да биде: hello:123456 доколку 123456 е вашиот индекс. За успешно логирање, ќе добиете повратна порака од серверот во остварената конекција преку socket. Повратната порака е во формат: 123456:hello\n. Доколку ова е неуспешно, потребно е да ја терминирате конекцијата и да пробате од ново да се конектирате.
//
//        По добивањето на потврда дека сте успешно поврзани, може да се прати барање за примање на фајл од серверот. Барањето за примање на фајл треба да биде во формат: 123456:receive\n , на што серверот одговара со 123456:send:filename.txt\n , по што следи содржината на фајлот во наредните редови од стримот. Откако ќе се испрати целиот фајл, завршувањето на трансмисијата е означено со 123456:over\n во последниот испратен ред.
//
//        Примениот фајл треба да се прикачи заедно со кодот од задачата на означеното место за прикачување.
//
//        Дополнително, потребно е да ја испратите големината на фајлот преку посебна порака. Пораката за испраќање на големината на фајлот е во формат: 123456:size:135, во случај да вашиот индекс е 123456, а големината на фајлот е 135 бајти.
//
//        Треба да се имплементира само клиентот. За да се добијат бодови на задачата, треба да се изврши и да успее да искомуницира со серверот и да се прикачи кодот со кој сте ја оствариле комуникацијата.
//
//        Остварена комуникација без прикачен код нема да се оценува.
//
//        Прикачен код кој не остварил комуникација нема да се оценува.
//
//        Во кодот внатре во коментар ставете го вашето име, презиме и број на индекс. Доколку ова не е поставено, решението нема да се прегледува.
//
//        Плагијати најстрого ќе бидат казнети.
//
//
//
//        Бодување:
//
//        успешно отворена конекција со hello порака: 20 поени
//
//        успешно примен фајл: 30 поени
//
//        успешно пратена големина на фајл: 10 поени
//
//
///**
// * Аце Ѓорѓиевски 201183
// */
//public class TCPServer extends Thread{
//
//    private int port;
//    private ServerSocket serverSocket;
//
//
//    public TCPServer(int port) {
//        this.port = port;
//    }
//
//
//    @Override
//    public void run() {
//
//        try {
//            System.out.println("TCP Server is starting...");
//
//            serverSocket = new ServerSocket(this.port);
//        } catch (IOException e) {
//            e.printStackTrace();
//        }
//
//        System.out.println("TCP Server is started!");
//        System.out.println("Waiting for connections...");
//
//
//        while(true) {
//            Socket socket = new Socket();
//
//            try {
//                socket = serverSocket.accept();
//
//                SocketWorker wt = new SocketWorker(socket);
//                System.out.println("hi");
//                wt.start();
//            } catch (IOException e) {
//                e.printStackTrace();
//            }
//        }
//    }
//
//    public static void main(String[] args) {
//        TCPServer server = new TCPServer(Connection.PORT);
//        server.start();
//    }
//
//}
